; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l10-t1-p3---int100n150-m25---int100c150---s119---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 - location
t0 - truck
p0 p1 p2 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level6 level6)
(sum level0 level8 level8)
(sum level0 level9 level9)
(sum level0 level11 level11)
(sum level0 level15 level15)
(sum level0 level17 level17)
(sum level0 level18 level18)
(sum level0 level22 level22)
(sum level0 level23 level23)
(sum level1 level2 level3)
(sum level1 level6 level7)
(sum level1 level8 level9)
(sum level1 level9 level10)
(sum level1 level11 level12)
(sum level1 level15 level16)
(sum level1 level17 level18)
(sum level1 level18 level19)
(sum level1 level22 level23)
(sum level1 level23 level24)
(sum level2 level2 level4)
(sum level2 level6 level8)
(sum level2 level8 level10)
(sum level2 level9 level11)
(sum level2 level11 level13)
(sum level2 level15 level17)
(sum level2 level17 level19)
(sum level2 level18 level20)
(sum level2 level22 level24)
(sum level2 level23 level25)
(sum level3 level2 level5)
(sum level3 level6 level9)
(sum level3 level8 level11)
(sum level3 level9 level12)
(sum level3 level11 level14)
(sum level3 level15 level18)
(sum level3 level17 level20)
(sum level3 level18 level21)
(sum level3 level22 level25)
(sum level3 level23 level26)
(sum level4 level2 level6)
(sum level4 level6 level10)
(sum level4 level8 level12)
(sum level4 level9 level13)
(sum level4 level11 level15)
(sum level4 level15 level19)
(sum level4 level17 level21)
(sum level4 level18 level22)
(sum level4 level22 level26)
(sum level4 level23 level27)
(sum level5 level2 level7)
(sum level5 level6 level11)
(sum level5 level8 level13)
(sum level5 level9 level14)
(sum level5 level11 level16)
(sum level5 level15 level20)
(sum level5 level17 level22)
(sum level5 level18 level23)
(sum level5 level22 level27)
(sum level5 level23 level28)
(sum level6 level2 level8)
(sum level6 level6 level12)
(sum level6 level8 level14)
(sum level6 level9 level15)
(sum level6 level11 level17)
(sum level6 level15 level21)
(sum level6 level17 level23)
(sum level6 level18 level24)
(sum level6 level22 level28)
(sum level6 level23 level29)
(sum level7 level2 level9)
(sum level7 level6 level13)
(sum level7 level8 level15)
(sum level7 level9 level16)
(sum level7 level11 level18)
(sum level7 level15 level22)
(sum level7 level17 level24)
(sum level7 level18 level25)
(sum level7 level22 level29)
(sum level7 level23 level30)
(sum level8 level2 level10)
(sum level8 level6 level14)
(sum level8 level8 level16)
(sum level8 level9 level17)
(sum level8 level11 level19)
(sum level8 level15 level23)
(sum level8 level17 level25)
(sum level8 level18 level26)
(sum level8 level22 level30)
(sum level8 level23 level31)
(sum level9 level2 level11)
(sum level9 level6 level15)
(sum level9 level8 level17)
(sum level9 level9 level18)
(sum level9 level11 level20)
(sum level9 level15 level24)
(sum level9 level17 level26)
(sum level9 level18 level27)
(sum level9 level22 level31)
(sum level9 level23 level32)
(sum level10 level2 level12)
(sum level10 level6 level16)
(sum level10 level8 level18)
(sum level10 level9 level19)
(sum level10 level11 level21)
(sum level10 level15 level25)
(sum level10 level17 level27)
(sum level10 level18 level28)
(sum level10 level22 level32)
(sum level10 level23 level33)
(sum level11 level2 level13)
(sum level11 level6 level17)
(sum level11 level8 level19)
(sum level11 level9 level20)
(sum level11 level11 level22)
(sum level11 level15 level26)
(sum level11 level17 level28)
(sum level11 level18 level29)
(sum level11 level22 level33)
(sum level11 level23 level34)
(sum level12 level2 level14)
(sum level12 level6 level18)
(sum level12 level8 level20)
(sum level12 level9 level21)
(sum level12 level11 level23)
(sum level12 level15 level27)
(sum level12 level17 level29)
(sum level12 level18 level30)
(sum level12 level22 level34)
(sum level12 level23 level35)
(sum level13 level2 level15)
(sum level13 level6 level19)
(sum level13 level8 level21)
(sum level13 level9 level22)
(sum level13 level11 level24)
(sum level13 level15 level28)
(sum level13 level17 level30)
(sum level13 level18 level31)
(sum level13 level22 level35)
(sum level13 level23 level36)
(sum level14 level2 level16)
(sum level14 level6 level20)
(sum level14 level8 level22)
(sum level14 level9 level23)
(sum level14 level11 level25)
(sum level14 level15 level29)
(sum level14 level17 level31)
(sum level14 level18 level32)
(sum level14 level22 level36)
(sum level14 level23 level37)
(sum level15 level2 level17)
(sum level15 level6 level21)
(sum level15 level8 level23)
(sum level15 level9 level24)
(sum level15 level11 level26)
(sum level15 level15 level30)
(sum level15 level17 level32)
(sum level15 level18 level33)
(sum level15 level22 level37)
(sum level15 level23 level38)
(sum level16 level2 level18)
(sum level16 level6 level22)
(sum level16 level8 level24)
(sum level16 level9 level25)
(sum level16 level11 level27)
(sum level16 level15 level31)
(sum level16 level17 level33)
(sum level16 level18 level34)
(sum level16 level22 level38)
(sum level16 level23 level39)
(sum level17 level2 level19)
(sum level17 level6 level23)
(sum level17 level8 level25)
(sum level17 level9 level26)
(sum level17 level11 level28)
(sum level17 level15 level32)
(sum level17 level17 level34)
(sum level17 level18 level35)
(sum level17 level22 level39)
(sum level17 level23 level40)
(sum level18 level2 level20)
(sum level18 level6 level24)
(sum level18 level8 level26)
(sum level18 level9 level27)
(sum level18 level11 level29)
(sum level18 level15 level33)
(sum level18 level17 level35)
(sum level18 level18 level36)
(sum level18 level22 level40)
(sum level18 level23 level41)
(sum level19 level2 level21)
(sum level19 level6 level25)
(sum level19 level8 level27)
(sum level19 level9 level28)
(sum level19 level11 level30)
(sum level19 level15 level34)
(sum level19 level17 level36)
(sum level19 level18 level37)
(sum level19 level22 level41)
(sum level19 level23 level42)
(sum level20 level2 level22)
(sum level20 level6 level26)
(sum level20 level8 level28)
(sum level20 level9 level29)
(sum level20 level11 level31)
(sum level20 level15 level35)
(sum level20 level17 level37)
(sum level20 level18 level38)
(sum level20 level22 level42)
(sum level20 level23 level43)
(sum level21 level2 level23)
(sum level21 level6 level27)
(sum level21 level8 level29)
(sum level21 level9 level30)
(sum level21 level11 level32)
(sum level21 level15 level36)
(sum level21 level17 level38)
(sum level21 level18 level39)
(sum level21 level22 level43)
(sum level21 level23 level44)
(sum level22 level2 level24)
(sum level22 level6 level28)
(sum level22 level8 level30)
(sum level22 level9 level31)
(sum level22 level11 level33)
(sum level22 level15 level37)
(sum level22 level17 level39)
(sum level22 level18 level40)
(sum level22 level22 level44)
(sum level22 level23 level45)
(sum level23 level2 level25)
(sum level23 level6 level29)
(sum level23 level8 level31)
(sum level23 level9 level32)
(sum level23 level11 level34)
(sum level23 level15 level38)
(sum level23 level17 level40)
(sum level23 level18 level41)
(sum level23 level22 level45)
(sum level23 level23 level46)
(sum level24 level2 level26)
(sum level24 level6 level30)
(sum level24 level8 level32)
(sum level24 level9 level33)
(sum level24 level11 level35)
(sum level24 level15 level39)
(sum level24 level17 level41)
(sum level24 level18 level42)
(sum level24 level22 level46)
(sum level24 level23 level47)
(sum level25 level2 level27)
(sum level25 level6 level31)
(sum level25 level8 level33)
(sum level25 level9 level34)
(sum level25 level11 level36)
(sum level25 level15 level40)
(sum level25 level17 level42)
(sum level25 level18 level43)
(sum level25 level22 level47)
(sum level25 level23 level48)
(sum level26 level2 level28)
(sum level26 level6 level32)
(sum level26 level8 level34)
(sum level26 level9 level35)
(sum level26 level11 level37)
(sum level26 level15 level41)
(sum level26 level17 level43)
(sum level26 level18 level44)
(sum level26 level22 level48)
(sum level26 level23 level49)
(sum level27 level2 level29)
(sum level27 level6 level33)
(sum level27 level8 level35)
(sum level27 level9 level36)
(sum level27 level11 level38)
(sum level27 level15 level42)
(sum level27 level17 level44)
(sum level27 level18 level45)
(sum level27 level22 level49)
(sum level27 level23 level50)
(sum level28 level2 level30)
(sum level28 level6 level34)
(sum level28 level8 level36)
(sum level28 level9 level37)
(sum level28 level11 level39)
(sum level28 level15 level43)
(sum level28 level17 level45)
(sum level28 level18 level46)
(sum level28 level22 level50)
(sum level28 level23 level51)
(sum level29 level2 level31)
(sum level29 level6 level35)
(sum level29 level8 level37)
(sum level29 level9 level38)
(sum level29 level11 level40)
(sum level29 level15 level44)
(sum level29 level17 level46)
(sum level29 level18 level47)
(sum level29 level22 level51)
(sum level29 level23 level52)
(sum level30 level2 level32)
(sum level30 level6 level36)
(sum level30 level8 level38)
(sum level30 level9 level39)
(sum level30 level11 level41)
(sum level30 level15 level45)
(sum level30 level17 level47)
(sum level30 level18 level48)
(sum level30 level22 level52)
(sum level30 level23 level53)
(sum level31 level2 level33)
(sum level31 level6 level37)
(sum level31 level8 level39)
(sum level31 level9 level40)
(sum level31 level11 level42)
(sum level31 level15 level46)
(sum level31 level17 level48)
(sum level31 level18 level49)
(sum level31 level22 level53)
(sum level31 level23 level54)
(sum level32 level2 level34)
(sum level32 level6 level38)
(sum level32 level8 level40)
(sum level32 level9 level41)
(sum level32 level11 level43)
(sum level32 level15 level47)
(sum level32 level17 level49)
(sum level32 level18 level50)
(sum level32 level22 level54)
(sum level32 level23 level55)
(sum level33 level2 level35)
(sum level33 level6 level39)
(sum level33 level8 level41)
(sum level33 level9 level42)
(sum level33 level11 level44)
(sum level33 level15 level48)
(sum level33 level17 level50)
(sum level33 level18 level51)
(sum level33 level22 level55)
(sum level33 level23 level56)
(sum level34 level2 level36)
(sum level34 level6 level40)
(sum level34 level8 level42)
(sum level34 level9 level43)
(sum level34 level11 level45)
(sum level34 level15 level49)
(sum level34 level17 level51)
(sum level34 level18 level52)
(sum level34 level22 level56)
(sum level34 level23 level57)
(sum level35 level2 level37)
(sum level35 level6 level41)
(sum level35 level8 level43)
(sum level35 level9 level44)
(sum level35 level11 level46)
(sum level35 level15 level50)
(sum level35 level17 level52)
(sum level35 level18 level53)
(sum level35 level22 level57)
(sum level35 level23 level58)
(sum level36 level2 level38)
(sum level36 level6 level42)
(sum level36 level8 level44)
(sum level36 level9 level45)
(sum level36 level11 level47)
(sum level36 level15 level51)
(sum level36 level17 level53)
(sum level36 level18 level54)
(sum level36 level22 level58)
(sum level36 level23 level59)
(sum level37 level2 level39)
(sum level37 level6 level43)
(sum level37 level8 level45)
(sum level37 level9 level46)
(sum level37 level11 level48)
(sum level37 level15 level52)
(sum level37 level17 level54)
(sum level37 level18 level55)
(sum level37 level22 level59)
(sum level37 level23 level60)
(sum level38 level2 level40)
(sum level38 level6 level44)
(sum level38 level8 level46)
(sum level38 level9 level47)
(sum level38 level11 level49)
(sum level38 level15 level53)
(sum level38 level17 level55)
(sum level38 level18 level56)
(sum level38 level22 level60)
(sum level38 level23 level61)
(sum level39 level2 level41)
(sum level39 level6 level45)
(sum level39 level8 level47)
(sum level39 level9 level48)
(sum level39 level11 level50)
(sum level39 level15 level54)
(sum level39 level17 level56)
(sum level39 level18 level57)
(sum level39 level22 level61)
(sum level39 level23 level62)
(sum level40 level2 level42)
(sum level40 level6 level46)
(sum level40 level8 level48)
(sum level40 level9 level49)
(sum level40 level11 level51)
(sum level40 level15 level55)
(sum level40 level17 level57)
(sum level40 level18 level58)
(sum level40 level22 level62)
(sum level40 level23 level63)
(sum level41 level2 level43)
(sum level41 level6 level47)
(sum level41 level8 level49)
(sum level41 level9 level50)
(sum level41 level11 level52)
(sum level41 level15 level56)
(sum level41 level17 level58)
(sum level41 level18 level59)
(sum level41 level22 level63)
(sum level41 level23 level64)
(sum level42 level2 level44)
(sum level42 level6 level48)
(sum level42 level8 level50)
(sum level42 level9 level51)
(sum level42 level11 level53)
(sum level42 level15 level57)
(sum level42 level17 level59)
(sum level42 level18 level60)
(sum level42 level22 level64)
(sum level42 level23 level65)
(sum level43 level2 level45)
(sum level43 level6 level49)
(sum level43 level8 level51)
(sum level43 level9 level52)
(sum level43 level11 level54)
(sum level43 level15 level58)
(sum level43 level17 level60)
(sum level43 level18 level61)
(sum level43 level22 level65)
(sum level43 level23 level66)
(sum level44 level2 level46)
(sum level44 level6 level50)
(sum level44 level8 level52)
(sum level44 level9 level53)
(sum level44 level11 level55)
(sum level44 level15 level59)
(sum level44 level17 level61)
(sum level44 level18 level62)
(sum level44 level22 level66)
(sum level44 level23 level67)
(sum level45 level2 level47)
(sum level45 level6 level51)
(sum level45 level8 level53)
(sum level45 level9 level54)
(sum level45 level11 level56)
(sum level45 level15 level60)
(sum level45 level17 level62)
(sum level45 level18 level63)
(sum level45 level22 level67)
(sum level45 level23 level68)
(sum level46 level2 level48)
(sum level46 level6 level52)
(sum level46 level8 level54)
(sum level46 level9 level55)
(sum level46 level11 level57)
(sum level46 level15 level61)
(sum level46 level17 level63)
(sum level46 level18 level64)
(sum level46 level22 level68)
(sum level46 level23 level69)
(sum level47 level2 level49)
(sum level47 level6 level53)
(sum level47 level8 level55)
(sum level47 level9 level56)
(sum level47 level11 level58)
(sum level47 level15 level62)
(sum level47 level17 level64)
(sum level47 level18 level65)
(sum level47 level22 level69)
(sum level47 level23 level70)
(sum level48 level2 level50)
(sum level48 level6 level54)
(sum level48 level8 level56)
(sum level48 level9 level57)
(sum level48 level11 level59)
(sum level48 level15 level63)
(sum level48 level17 level65)
(sum level48 level18 level66)
(sum level48 level22 level70)
(sum level48 level23 level71)
(sum level49 level2 level51)
(sum level49 level6 level55)
(sum level49 level8 level57)
(sum level49 level9 level58)
(sum level49 level11 level60)
(sum level49 level15 level64)
(sum level49 level17 level66)
(sum level49 level18 level67)
(sum level49 level22 level71)
(sum level49 level23 level72)
(sum level50 level2 level52)
(sum level50 level6 level56)
(sum level50 level8 level58)
(sum level50 level9 level59)
(sum level50 level11 level61)
(sum level50 level15 level65)
(sum level50 level17 level67)
(sum level50 level18 level68)
(sum level50 level22 level72)
(sum level50 level23 level73)
(sum level51 level2 level53)
(sum level51 level6 level57)
(sum level51 level8 level59)
(sum level51 level9 level60)
(sum level51 level11 level62)
(sum level51 level15 level66)
(sum level51 level17 level68)
(sum level51 level18 level69)
(sum level51 level22 level73)
(sum level51 level23 level74)
(sum level52 level2 level54)
(sum level52 level6 level58)
(sum level52 level8 level60)
(sum level52 level9 level61)
(sum level52 level11 level63)
(sum level52 level15 level67)
(sum level52 level17 level69)
(sum level52 level18 level70)
(sum level52 level22 level74)
(sum level52 level23 level75)
(sum level53 level2 level55)
(sum level53 level6 level59)
(sum level53 level8 level61)
(sum level53 level9 level62)
(sum level53 level11 level64)
(sum level53 level15 level68)
(sum level53 level17 level70)
(sum level53 level18 level71)
(sum level53 level22 level75)
(sum level53 level23 level76)
(sum level54 level2 level56)
(sum level54 level6 level60)
(sum level54 level8 level62)
(sum level54 level9 level63)
(sum level54 level11 level65)
(sum level54 level15 level69)
(sum level54 level17 level71)
(sum level54 level18 level72)
(sum level54 level22 level76)
(sum level54 level23 level77)
(sum level55 level2 level57)
(sum level55 level6 level61)
(sum level55 level8 level63)
(sum level55 level9 level64)
(sum level55 level11 level66)
(sum level55 level15 level70)
(sum level55 level17 level72)
(sum level55 level18 level73)
(sum level55 level22 level77)
(sum level55 level23 level78)
(sum level56 level2 level58)
(sum level56 level6 level62)
(sum level56 level8 level64)
(sum level56 level9 level65)
(sum level56 level11 level67)
(sum level56 level15 level71)
(sum level56 level17 level73)
(sum level56 level18 level74)
(sum level56 level22 level78)
(sum level56 level23 level79)
(sum level57 level2 level59)
(sum level57 level6 level63)
(sum level57 level8 level65)
(sum level57 level9 level66)
(sum level57 level11 level68)
(sum level57 level15 level72)
(sum level57 level17 level74)
(sum level57 level18 level75)
(sum level57 level22 level79)
(sum level57 level23 level80)
(sum level58 level2 level60)
(sum level58 level6 level64)
(sum level58 level8 level66)
(sum level58 level9 level67)
(sum level58 level11 level69)
(sum level58 level15 level73)
(sum level58 level17 level75)
(sum level58 level18 level76)
(sum level58 level22 level80)
(sum level58 level23 level81)
(sum level59 level2 level61)
(sum level59 level6 level65)
(sum level59 level8 level67)
(sum level59 level9 level68)
(sum level59 level11 level70)
(sum level59 level15 level74)
(sum level59 level17 level76)
(sum level59 level18 level77)
(sum level59 level22 level81)
(sum level59 level23 level82)
(sum level60 level2 level62)
(sum level60 level6 level66)
(sum level60 level8 level68)
(sum level60 level9 level69)
(sum level60 level11 level71)
(sum level60 level15 level75)
(sum level60 level17 level77)
(sum level60 level18 level78)
(sum level60 level22 level82)
(sum level60 level23 level83)
(sum level61 level2 level63)
(sum level61 level6 level67)
(sum level61 level8 level69)
(sum level61 level9 level70)
(sum level61 level11 level72)
(sum level61 level15 level76)
(sum level61 level17 level78)
(sum level61 level18 level79)
(sum level61 level22 level83)
(sum level61 level23 level84)
(sum level62 level2 level64)
(sum level62 level6 level68)
(sum level62 level8 level70)
(sum level62 level9 level71)
(sum level62 level11 level73)
(sum level62 level15 level77)
(sum level62 level17 level79)
(sum level62 level18 level80)
(sum level62 level22 level84)
(sum level62 level23 level85)
(sum level63 level2 level65)
(sum level63 level6 level69)
(sum level63 level8 level71)
(sum level63 level9 level72)
(sum level63 level11 level74)
(sum level63 level15 level78)
(sum level63 level17 level80)
(sum level63 level18 level81)
(sum level63 level22 level85)
(sum level63 level23 level86)
(sum level64 level2 level66)
(sum level64 level6 level70)
(sum level64 level8 level72)
(sum level64 level9 level73)
(sum level64 level11 level75)
(sum level64 level15 level79)
(sum level64 level17 level81)
(sum level64 level18 level82)
(sum level64 level22 level86)
(sum level64 level23 level87)
(sum level65 level2 level67)
(sum level65 level6 level71)
(sum level65 level8 level73)
(sum level65 level9 level74)
(sum level65 level11 level76)
(sum level65 level15 level80)
(sum level65 level17 level82)
(sum level65 level18 level83)
(sum level65 level22 level87)
(sum level65 level23 level88)
(sum level66 level2 level68)
(sum level66 level6 level72)
(sum level66 level8 level74)
(sum level66 level9 level75)
(sum level66 level11 level77)
(sum level66 level15 level81)
(sum level66 level17 level83)
(sum level66 level18 level84)
(sum level66 level22 level88)
(sum level66 level23 level89)
(sum level67 level2 level69)
(sum level67 level6 level73)
(sum level67 level8 level75)
(sum level67 level9 level76)
(sum level67 level11 level78)
(sum level67 level15 level82)
(sum level67 level17 level84)
(sum level67 level18 level85)
(sum level67 level22 level89)
(sum level67 level23 level90)
(sum level68 level2 level70)
(sum level68 level6 level74)
(sum level68 level8 level76)
(sum level68 level9 level77)
(sum level68 level11 level79)
(sum level68 level15 level83)
(sum level68 level17 level85)
(sum level68 level18 level86)
(sum level68 level22 level90)
(sum level68 level23 level91)
(sum level69 level2 level71)
(sum level69 level6 level75)
(sum level69 level8 level77)
(sum level69 level9 level78)
(sum level69 level11 level80)
(sum level69 level15 level84)
(sum level69 level17 level86)
(sum level69 level18 level87)
(sum level69 level22 level91)
(sum level69 level23 level92)
(sum level70 level2 level72)
(sum level70 level6 level76)
(sum level70 level8 level78)
(sum level70 level9 level79)
(sum level70 level11 level81)
(sum level70 level15 level85)
(sum level70 level17 level87)
(sum level70 level18 level88)
(sum level70 level22 level92)
(sum level70 level23 level93)
(sum level71 level2 level73)
(sum level71 level6 level77)
(sum level71 level8 level79)
(sum level71 level9 level80)
(sum level71 level11 level82)
(sum level71 level15 level86)
(sum level71 level17 level88)
(sum level71 level18 level89)
(sum level71 level22 level93)
(sum level71 level23 level94)
(sum level72 level2 level74)
(sum level72 level6 level78)
(sum level72 level8 level80)
(sum level72 level9 level81)
(sum level72 level11 level83)
(sum level72 level15 level87)
(sum level72 level17 level89)
(sum level72 level18 level90)
(sum level72 level22 level94)
(sum level72 level23 level95)
(sum level73 level2 level75)
(sum level73 level6 level79)
(sum level73 level8 level81)
(sum level73 level9 level82)
(sum level73 level11 level84)
(sum level73 level15 level88)
(sum level73 level17 level90)
(sum level73 level18 level91)
(sum level73 level22 level95)
(sum level73 level23 level96)
(sum level74 level2 level76)
(sum level74 level6 level80)
(sum level74 level8 level82)
(sum level74 level9 level83)
(sum level74 level11 level85)
(sum level74 level15 level89)
(sum level74 level17 level91)
(sum level74 level18 level92)
(sum level74 level22 level96)
(sum level74 level23 level97)
(sum level75 level2 level77)
(sum level75 level6 level81)
(sum level75 level8 level83)
(sum level75 level9 level84)
(sum level75 level11 level86)
(sum level75 level15 level90)
(sum level75 level17 level92)
(sum level75 level18 level93)
(sum level75 level22 level97)
(sum level75 level23 level98)
(sum level76 level2 level78)
(sum level76 level6 level82)
(sum level76 level8 level84)
(sum level76 level9 level85)
(sum level76 level11 level87)
(sum level76 level15 level91)
(sum level76 level17 level93)
(sum level76 level18 level94)
(sum level76 level22 level98)
(sum level76 level23 level99)
(sum level77 level2 level79)
(sum level77 level6 level83)
(sum level77 level8 level85)
(sum level77 level9 level86)
(sum level77 level11 level88)
(sum level77 level15 level92)
(sum level77 level17 level94)
(sum level77 level18 level95)
(sum level77 level22 level99)
(sum level77 level23 level100)
(sum level78 level2 level80)
(sum level78 level6 level84)
(sum level78 level8 level86)
(sum level78 level9 level87)
(sum level78 level11 level89)
(sum level78 level15 level93)
(sum level78 level17 level95)
(sum level78 level18 level96)
(sum level78 level22 level100)
(sum level78 level23 level101)
(sum level79 level2 level81)
(sum level79 level6 level85)
(sum level79 level8 level87)
(sum level79 level9 level88)
(sum level79 level11 level90)
(sum level79 level15 level94)
(sum level79 level17 level96)
(sum level79 level18 level97)
(sum level79 level22 level101)
(sum level79 level23 level102)
(sum level80 level2 level82)
(sum level80 level6 level86)
(sum level80 level8 level88)
(sum level80 level9 level89)
(sum level80 level11 level91)
(sum level80 level15 level95)
(sum level80 level17 level97)
(sum level80 level18 level98)
(sum level80 level22 level102)
(sum level80 level23 level103)
(sum level81 level2 level83)
(sum level81 level6 level87)
(sum level81 level8 level89)
(sum level81 level9 level90)
(sum level81 level11 level92)
(sum level81 level15 level96)
(sum level81 level17 level98)
(sum level81 level18 level99)
(sum level81 level22 level103)
(sum level81 level23 level104)
(sum level82 level2 level84)
(sum level82 level6 level88)
(sum level82 level8 level90)
(sum level82 level9 level91)
(sum level82 level11 level93)
(sum level82 level15 level97)
(sum level82 level17 level99)
(sum level82 level18 level100)
(sum level82 level22 level104)
(sum level82 level23 level105)
(sum level83 level2 level85)
(sum level83 level6 level89)
(sum level83 level8 level91)
(sum level83 level9 level92)
(sum level83 level11 level94)
(sum level83 level15 level98)
(sum level83 level17 level100)
(sum level83 level18 level101)
(sum level83 level22 level105)
(sum level84 level2 level86)
(sum level84 level6 level90)
(sum level84 level8 level92)
(sum level84 level9 level93)
(sum level84 level11 level95)
(sum level84 level15 level99)
(sum level84 level17 level101)
(sum level84 level18 level102)
(sum level85 level2 level87)
(sum level85 level6 level91)
(sum level85 level8 level93)
(sum level85 level9 level94)
(sum level85 level11 level96)
(sum level85 level15 level100)
(sum level85 level17 level102)
(sum level85 level18 level103)
(sum level86 level2 level88)
(sum level86 level6 level92)
(sum level86 level8 level94)
(sum level86 level9 level95)
(sum level86 level11 level97)
(sum level86 level15 level101)
(sum level86 level17 level103)
(sum level86 level18 level104)
(sum level87 level2 level89)
(sum level87 level6 level93)
(sum level87 level8 level95)
(sum level87 level9 level96)
(sum level87 level11 level98)
(sum level87 level15 level102)
(sum level87 level17 level104)
(sum level87 level18 level105)
(sum level88 level2 level90)
(sum level88 level6 level94)
(sum level88 level8 level96)
(sum level88 level9 level97)
(sum level88 level11 level99)
(sum level88 level15 level103)
(sum level88 level17 level105)
(sum level89 level2 level91)
(sum level89 level6 level95)
(sum level89 level8 level97)
(sum level89 level9 level98)
(sum level89 level11 level100)
(sum level89 level15 level104)
(sum level90 level2 level92)
(sum level90 level6 level96)
(sum level90 level8 level98)
(sum level90 level9 level99)
(sum level90 level11 level101)
(sum level90 level15 level105)
(sum level91 level2 level93)
(sum level91 level6 level97)
(sum level91 level8 level99)
(sum level91 level9 level100)
(sum level91 level11 level102)
(sum level92 level2 level94)
(sum level92 level6 level98)
(sum level92 level8 level100)
(sum level92 level9 level101)
(sum level92 level11 level103)
(sum level93 level2 level95)
(sum level93 level6 level99)
(sum level93 level8 level101)
(sum level93 level9 level102)
(sum level93 level11 level104)
(sum level94 level2 level96)
(sum level94 level6 level100)
(sum level94 level8 level102)
(sum level94 level9 level103)
(sum level94 level11 level105)
(sum level95 level2 level97)
(sum level95 level6 level101)
(sum level95 level8 level103)
(sum level95 level9 level104)
(sum level96 level2 level98)
(sum level96 level6 level102)
(sum level96 level8 level104)
(sum level96 level9 level105)
(sum level97 level2 level99)
(sum level97 level6 level103)
(sum level97 level8 level105)
(sum level98 level2 level100)
(sum level98 level6 level104)
(sum level99 level2 level101)
(sum level99 level6 level105)
(sum level100 level2 level102)
(sum level101 level2 level103)
(sum level102 level2 level104)
(sum level103 level2 level105)

(connected l0 l7)
(fuelcost level23 l0 l7)
(connected l0 l8)
(fuelcost level22 l0 l8)
(connected l1 l3)
(fuelcost level6 l1 l3)
(connected l1 l5)
(fuelcost level23 l1 l5)
(connected l1 l8)
(fuelcost level11 l1 l8)
(connected l1 l9)
(fuelcost level22 l1 l9)
(connected l2 l8)
(fuelcost level6 l2 l8)
(connected l2 l9)
(fuelcost level15 l2 l9)
(connected l3 l1)
(fuelcost level6 l3 l1)
(connected l3 l4)
(fuelcost level8 l3 l4)
(connected l3 l5)
(fuelcost level18 l3 l5)
(connected l3 l9)
(fuelcost level17 l3 l9)
(connected l4 l3)
(fuelcost level8 l4 l3)
(connected l4 l9)
(fuelcost level2 l4 l9)
(connected l5 l1)
(fuelcost level23 l5 l1)
(connected l5 l3)
(fuelcost level18 l5 l3)
(connected l5 l7)
(fuelcost level2 l5 l7)
(connected l6 l8)
(fuelcost level6 l6 l8)
(connected l7 l0)
(fuelcost level23 l7 l0)
(connected l7 l5)
(fuelcost level2 l7 l5)
(connected l8 l0)
(fuelcost level22 l8 l0)
(connected l8 l1)
(fuelcost level11 l8 l1)
(connected l8 l2)
(fuelcost level6 l8 l2)
(connected l8 l6)
(fuelcost level6 l8 l6)
(connected l8 l9)
(fuelcost level9 l8 l9)
(connected l9 l1)
(fuelcost level22 l9 l1)
(connected l9 l2)
(fuelcost level15 l9 l2)
(connected l9 l3)
(fuelcost level17 l9 l3)
(connected l9 l4)
(fuelcost level2 l9 l4)
(connected l9 l8)
(fuelcost level9 l9 l8)

(at t0 l2)
(fuel t0 level105)
(= (total-cost) 0)

(at p0 l9)
(at p1 l5)
(at p2 l2)
)

(:goal
(and
(at p0 l1)
(at p1 l1)
(at p2 l7)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 0 of 3
2. (drive t0 l2 l9 level90 level15 level105)
   deleted: (at t0 l2) (fuel t0 level105)
   added: (at t0 l9) (fuel t0 level90)
   goals met: 0 of 3
3. (load p0 t0 l9)
   deleted: (at p0 l9)
   added: (in p0 t0)
   goals met: 0 of 3
4. (drive t0 l9 l3 level73 level17 level90)
   deleted: (at t0 l9) (fuel t0 level90)
   added: (at t0 l3) (fuel t0 level73)
   goals met: 0 of 3
5. (drive t0 l3 l5 level55 level18 level73)
   deleted: (at t0 l3) (fuel t0 level73)
   added: (at t0 l5) (fuel t0 level55)
   goals met: 0 of 3
6. (load p1 t0 l5)
   deleted: (at p1 l5)
   added: (in p1 t0)
   goals met: 0 of 3
7. (drive t0 l5 l1 level32 level23 level55)
   deleted: (at t0 l5) (fuel t0 level55)
   added: (at t0 l1) (fuel t0 level32)
   goals met: 0 of 3
8. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 1 of 3
9. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 2 of 3
10. (drive t0 l1 l5 level9 level23 level32)
   deleted: (at t0 l1) (fuel t0 level32)
   added: (at t0 l5) (fuel t0 level9)
   goals met: 2 of 3
11. (drive t0 l5 l7 level7 level2 level9)
   deleted: (at t0 l5) (fuel t0 level9)
   added: (at t0 l7) (fuel t0 level7)
   goals met: 2 of 3
12. (unload p2 t0 l7)
   deleted: (in p2 t0)
   added: (at p2 l7)
   goals met: 3 of 3
